src/cf/InformationRegisters/AdditionalInfo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>AdditionalInfo</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Value</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Comment>// ACC:1330 возможно хранение любых данных</Comment>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Property</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/AdditionalInfo/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Common.SubsystemExists("StandardSubsystems.ObjectsVersioning") Then
		ModifiedObjects = UnloadColumn("Object");
		ModifiedObjects = CommonClientServer.CollapseArray(ModifiedObjects);

		If ModifiedObjects.Count() = 0 Then
			If ValueIsFilled(Filter.Object.Value) Then
				ModifiedObjects.Add(Filter.Object.Value);
			Else
				ModifiedObjects = AllObjects();
			EndIf;
		EndIf;
		
		ModuleObjectsVersioning = Common.CommonModule("ObjectsVersioning");
		SetPrivilegedMode(True);
		
		For Each Ref In ModifiedObjects Do
			If Common.IsRecordSetDeletion(Replacing) Then
				ObjectRecords = New Array;
			Else
				AllRecords = Unload();
				ObjectRecords = AllRecords.FindRows(New Structure("Object", Ref));
			EndIf;
			
			ModifiedObject = Ref.GetObject();
			If ModifiedObject <> Undefined Then
				ModifiedObject.AdditionalProperties.Insert("WrittenAdditionalInfo", ObjectRecords);
				ModuleObjectsVersioning.WriteObjectVersion(ModifiedObject);
			EndIf;
		EndDo;
		
		SetPrivilegedMode(False);
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

Function AllObjects()
	
	QueryText =
	"SELECT
	|	AdditionalInfo.Object AS Object
	|FROM
	|	InformationRegister.AdditionalInfo AS AdditionalInfo
	|GROUP BY
	|	AdditionalInfo.Object";
	
	Query = New Query(QueryText);
	Return Query.Execute().Unload().UnloadColumn("Object");
	
EndFunction

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.'");
#EndIf
